IRP/src/Documents/PriceList/PriceList.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>PriceList</name>
 <registerRecords>InformationRegister.PricesByItems</registerRecords>
 <registerRecords>InformationRegister.PricesByItemKeys</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>InformationRegister.PricesByProperties</registerRecords>
 <attributes>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceListType</name>
  <type>
   <types>EnumRef.PriceListTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Item</name>
   <type>
    <types>DefinedType.typeItem</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>InputUnit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>InputPrice</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ItemKeyList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>InputUnit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>InputPrice</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DataSet</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DataPrice</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>DefinedType.typeItem</types>
   </type>
  </attributes>
  <attributes>
   <name>InputUnit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>InputPrice</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Enums/PriceListTypes/PriceListTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PriceListTypes</name>
 <enumValues>
  <name>PriceByItems</name>
 </enumValues>
 <enumValues>
  <name>PriceByItemKeys</name>
 </enumValues>
 <enumValues>
  <name>PriceByProperties</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/PriceList/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref, True);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters, True);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);

	PricesByProperties = New ValueTable;
	PricesByProperties.Columns.Add("PriceList", New TypeDescription("DocumentRef.PriceList"));
	PricesByProperties.Columns.Add("PriceKey", New TypeDescription("CatalogRef.PriceKeys"));
	PricesByProperties.Columns.Add("Item", New TypeDescription("CatalogRef.Items"));
	PricesByProperties.Columns.Add("Unit", New TypeDescription("CatalogRef.Units"));
	PricesByProperties.Columns.Add("InputUnit", New TypeDescription("CatalogRef.Units"));
	PricesByProperties.Columns.Add("InputPrice", New TypeDescription(Metadata.DefinedTypes.typePrice.Type));
	PricesByProperties.Columns.Add("Price", New TypeDescription(Metadata.DefinedTypes.typePrice.Type));

	If Ref.PriceListType = Enums.PriceListTypes.PriceByProperties Then
		PricesByProperties = Catalogs.PriceKeys.GetTableByPriceList(Ref);
	EndIf;
	StrParams.Insert("PricesByProperties", PricesByProperties);
	Return StrParams;
EndFunction

#EndRegion

#Region Posting_SourceTable

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_MainTables
Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(PricesByItems());
	QueryArray.Add(PricesByItemKeys());
	QueryArray.Add(PricesByProperties());
	Return QueryArray;
EndFunction

Function PricesByItemKeys()
	Return "SELECT
		   |	PriceListItemKeyList.Ref.Date AS Period,
		   |	PriceListItemKeyList.Ref.PriceType AS PriceType,
		   |	PriceListItemKeyList.ItemKey,
		   |	PriceListItemKeyList.Unit,
		   |	PriceListItemKeyList.InputUnit,
		   |	PriceListItemKeyList.InputPrice,
		   |	PriceListItemKeyList.Price
		   |INTO PricesByItemKeys
		   |FROM
		   |	Document.PriceList.ItemKeyList AS PriceListItemKeyList
		   |WHERE
		   |	PriceListItemKeyList.Ref = &Ref";
EndFunction

Function PricesByItems()
	Return "SELECT
		   |	PriceListItemList.Ref.Date AS Period,
		   |	PriceListItemList.Ref.PriceType AS PriceType,
		   |	PriceListItemList.Item,
		   |	PriceListItemList.Unit,
		   |	PriceListItemList.InputUnit,
		   |	PriceListItemList.InputPrice,
		   |	PriceListItemList.Price
		   |INTO PricesByItems
		   |FROM
		   |	Document.PriceList.ItemList AS PriceListItemList
		   |WHERE
		   |	PriceListItemList.Ref = &Ref";
EndFunction

Function PricesByProperties()
	Return "SELECT
		   |	PricesByProperties.PriceList,
		   |	PricesByProperties.PriceKey,
		   |	PricesByProperties.Item,
		   |	PricesByProperties.Unit,
		   |	PricesByProperties.InputUnit,
		   |	PricesByProperties.InputPrice,
		   |	PricesByProperties.Price
		   |INTO tmp
		   |FROM
		   |	&PricesByProperties AS PricesByProperties
		   |;
		   |////////////////////////////////////////////////////////////////////////////////
		   |SELECT
		   |	tmp.PriceList,
		   |	tmp.PriceKey,
		   |	tmp.Item,
		   |	tmp.Unit,
		   |	tmp.InputUnit,
		   |	tmp.InputPrice,
		   |	tmp.Price,
		   |	DocPriceList.Date AS Period,
		   |	DocPriceList.PriceType
		   |INTO PricesByProperties
		   |FROM
		   |	Document.PriceList AS DocPriceList
		   |		INNER JOIN tmp AS tmp
		   |		ON tmp.PriceList = DocPriceList.Ref
		   |		AND DocPriceList.Ref = &Ref";
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	AccessKeyMap.Insert("Branch", Obj.Branch);
	Return AccessKeyMap;
EndFunction

#EndRegion
